# vim: set ft=ruby

tap "bazelbuild/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "chruby"
brew "fd"
brew "git"
brew "mas"
brew "postgresql@9.4", restart_service: true
brew "reattach-to-user-namespace"
brew "ruby-install"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh-completions"

brew "bazelbuild/tap/bazelisk"
brew "heroku/brew/heroku"

cask "bettertouchtool"
cask "ccmenu"
cask "fluor"
cask "font-go-mono"
cask "google-backup-and-sync"
cask "google-chrome"
cask "keepingyouawake"
cask "zoomus"

mas "1Password 7", id: 1333542190
mas "Divvy", id: 413857545
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Xcode", id: 497799835
