# vim: set ft=ruby

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "bash-completion"
brew "git"
brew "mas"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"

cask "bettertouchtool"
cask "ccmenu"
cask "fluor"
cask "google-backup-and-sync"
cask "google-chrome"
cask "keepingyouawake"
cask "zoomus"

mas "1Password 7", id: 1333542190
mas "Divvy", id: 413857545
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Xcode", id: 497799835
