cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"

brew "bash-completion"
brew "chruby"
brew "git"
brew "reattach-to-user-namespace"
brew "ruby"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"

cask "fluid"
cask "fluor"
cask "google-backup-and-sync"
cask "keepingyouawake"
cask "zoomus"

mas "1Password 7", id: 1333542190
mas "Divvy", id: 413857545
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Things3", id: 904280696
mas "iMovie", id: 408981434
