# vim: set ft=ruby

tap "cockroachdb/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "autoconf"
brew "bazelisk"
brew "ccache"
brew "cmake"
brew "entr"
brew "fd"
brew "fish"
brew "fswatch"
brew "fzf"
brew "git"
brew "go@1.16"
brew "k3d"
brew "libpq"
brew "make"
brew "mas"
brew "neovim"
brew "node@12"
brew "postgresql"
brew "pre-commit"
brew "protobuf"
brew "pulumi"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tree"
brew "vault"
brew "yarn"

brew "cockroachdb/tap/cockroach"

cask "docker", greedy: true
cask "figma"
cask "font-go"
cask "goland", greedy: true
cask "google-cloud-sdk"
cask "hammerspoon", greedy: true
cask "loom", greedy: true
cask "netnewswire", greedy: true
cask "raycast", greedy: true
cask "quitter", greedy: true
cask "tuple", greedy: true
cask "utc-menu-clock"
cask "visual-studio-code", greedy: true

mas "Magic Lasso Adblock for Safari", id: 1198047227
mas "Next Meeting", id: 1017470484
mas "Numbers", id: 409203825
mas "Parcel - Delivery Tracking", id: 639968404
mas "Simplified for Twitter", id: 1479307973
mas "Things", id: 904280696
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
