# vim: set ft=ruby

tap "cockroachdb/tap"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "autoconf"
brew "awscli"
brew "bash"
brew "bazelisk"
brew "ccache"
brew "cmake"
brew "cockroach"
brew "dart"
brew "entr"
brew "fd"
brew "fish"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "gpatch"
brew "graphviz"
brew "jq"
brew "k3d"
brew "libpq"
brew "lua"
brew "make"
brew "mas"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "node@16"
brew "pre-commit"
brew "protobuf"
brew "pulumi"
brew "shellcheck"
brew "terraform"
brew "the_silver_searcher"
brew "tree"
brew "vault"
brew "yarn"

cask "1password-cli"
cask "docker", greedy: true
cask "figma"
cask "font-go"
cask "goland", greedy: true
cask "google-cloud-sdk"
cask "hammerspoon", greedy: true
cask "loom", greedy: true
cask "mimestream", greedy: true
cask "netnewswire", greedy: true
cask "raycast", greedy: true
cask "tuple", greedy: true

mas "1Password for Safari", id: 1569813296
mas "Hush", id: 1544743900
mas "Magic Lasso Adblock for Safari", id: 1198047227
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Parcel - Delivery Tracking", id: 639968404
mas "Simplified for Twitter", id: 1479307973
mas "Things", id: 904280696
mas "Tot", id: 1491071483
mas "Xcode", id: 497799835
